<template>
    <div class="mt-6 text-center">
        <!-- <h2 class="font-display font-semibold text-2xl text-gray-900 dark:text-white mb-6">
      {{ currentLang === 'en' ? 'About This Website' : 'អំពីវេទិកានេះ' }}
    </h2> -->
        <p class="text-gray-600 dark:text-gray-300 leading-relaxed mb-4">

            <b>គាំទ្រការអប់រំ៖</b>
            ផ្តល់សម្ភារៈសិក្សា និងវគ្គបណ្តុះបណ្តាលឥតគិតថ្លៃដល់យុវជន។


            <!-- {{ currentLang === 'en' ? 'The SPRITUP Organization Legal Resources Hub was created to provide free and open access to Cambodian legal documents for everyone. Our mission is to make legal information more accessible to citizens, students, researchers, and legal professionals.' : 'កីយផ្សំឯកសារច្បាប់ក្រុមអង្គនៈស្ពឺតូផងណា បានបង្កើតដើម្បីផ្តល់សម្រាប់ឯកសារច្បាប់កម្ពុជាដល់គ្រប់គ្នា។ បណ្តុះបញ្ជូនរបស់យើងគឺដើម្បីធានាឯកសារច្បាប់ឲ្យអាចចូលរួតចិត្តបានជាមួយពលរដ្ឋ និស្សគ្រាចរណា ការស្រាវជ្រាវ និងអ្នកវិភ' }} -->
        </p>

        <p class="text-gray-600 dark:text-gray-300 leading-relaxed mb-4">
            <b>ពង្រីកគម្រោងសហគមន៍៖</b> ចុះជួយផ្ទាល់ដល់តំបន់ដែលខ្វះខាត និងត្រូវការជំនួយបន្ទាន់។
        </p>
        <p class="text-gray-600 dark:text-gray-300 leading-relaxed mb-4">
            <b>ទ្រទ្រង់ប្រតិបត្តិការ៖</b> ជួយគាំទ្រដល់ដំណើរការប្រចាំថ្ងៃរបស់មជ្ឈមណ្ឌល
            ដើម្បីឱ្យក្រុមការងារអាចបំពេញបេសកកម្មបានពេញលេញ។
            <!-- {{ currentLang === 'en' ? 'We believe that transparency in legal systems is essential for democracy and
            justice.By providing comprehensive and up - to - date legal resources, we aim to support education, research,
                and informed decision - making in Cambodia.' :
            'យើងជាអ្នកគណិតច្បាប់ដែលស្រឡាញ់ភាពឆ្មារឆ្មបីន្តិការណាដែលមានភាពស្មោះត្រង់
            យើងផ្តល់ជូនដោយឯកសារច្បាប់សំមង្ងាត់និងទាន់សរសេរដើម្បីគាំទ្រការអប់រំ ការស្រាវជ្រាវ
            និងការសម្រួលស្នើសុខត្រជាការសម្រួលក្នុងកម្ពុជា។' }} -->
        </p>

        <p class="text-gray-600 dark:text-gray-300 leading-relaxed mb-4">
            មជ្ឈមណ្ឌល SPRITUP សូមសន្យាថា រាល់ថវិកាដែលទទួលបានពីលោកអ្នក នឹងត្រូវបានគ្រប់គ្រងដោយតម្លាភាព
            និងប្រើប្រាស់ចំគោលដៅបំផុត។ របាយការណ៍សកម្មភាព និងហិរញ្ញវត្ថុ
            នឹងត្រូវបានផ្សព្វផ្សាយជូនអ្នកគាំទ្រទាំងអស់ជាប្រចាំ។ សូមអរគុណយ៉ាងជ្រាលជ្រៅចំពោះទឹកចិត្តសប្បុរសធម៌របស់អ្នក!
        </p>


        <p>
            ប្រសិនបើស្ថាប័ន ក្រុមហ៊ុន ឬលោកអ្នកមានបំណងចង់ក្លាយជា "ដៃគូឧបត្ថម្ភប្រចាំឆ្នាំ" ឬមានសំណួរផ្សេងៗ
            សូមបំពេញព័ត៌មានខាងក្រោម ឬទាក់ទងមកយើងខ្ញុំផ្ទាល់៖ <br>
            ទូរស័ព្ទ៖ + 855 69 505 726 <br>
            អ៊ីមែល៖ spritup.center@gmail.com <br>

        </p>
        <!-- <div class="grid md:grid-cols-3 gap-6 mt-8">
            <div class="text-center p-4 rounded-xl bg-brand-50 dark:bg-brand-900/20">
                <h3 class="font-display font-bold text-2xl text-brand-600 mb-2">{{ currentLang === 'en' ? 'Free Access'
                    : 'ចូលរួតសន្ធស្ត' }}</h3>
                <p class="text-sm text-gray-500 dark:text-gray-400">{{ currentLang === 'en' ? 'No subscription required'
                    : 'មិនតូចជាតិបន្ថែម' }}</p>
            </div>
            <div class="text-center p-4 rounded-xl bg-brand-50 dark:bg-brand-900/20">
                <h3 class="font-display font-bold text-2xl text-brand-600 mb-2">{{ currentLang === 'en' ? 'Always Updated' : 'បានធ្វើឲ្យទាន់ទាន់' }}</h3>
                <p class="text-sm text-gray-500 dark:text-gray-400">{{ currentLang === 'en' ? 'Latest legal documents' :
                    'ឯកសារច្បាប់ថ្មីៗ' }}</p>
            </div>
            <div class="text-center p-4 rounded-xl bg-brand-50 dark:bg-brand-900/20">
                <h3 class="font-display font-bold text-2xl text-brand-600 mb-2">{{ currentLang === 'en' ? 'For Everyone'
                    : 'សម្រាប់គ្រប់គ្នា' }}</h3>
                <p class="text-sm text-gray-500 dark:text-gray-400">{{ currentLang === 'en' ? 'Citizens and professionals' : 'ពលរដ្ឋ និងវិភាគ' }}</p>
            </div>
        </div> -->
    </div>
</template>

<script setup>
defineProps({
    currentLang: { type: String, default: 'en' }
})
</script>
